---
kind: method
id: M:Autodesk.Revit.DB.FilterCategoryRule.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
source: html/64d860ff-691b-59d5-b2ec-938386718cb8.htm
---
# Autodesk.Revit.DB.FilterCategoryRule.#ctor Method

Constructs a new instance of FilterCategoryRule.

## Syntax (C#)
```csharp
public FilterCategoryRule(
	ICollection<ElementId> categories
)
```

## Parameters
- **categories** (`System.Collections.Generic.ICollection < ElementId >`) - The set of categories.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null